Validation_Cases/Backward_facing_step/Coarse_SA/system/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/


wallShearStress1
{
    type        wallShearStress;
    libs        (fieldFunctionObjects);

    writeControl    writeTime;
    patches         (beforeStep afterStep);
}





// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //